
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8344647568)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_member.telegram-sa-roles[&#34;roles/run.invoker&#34;]
  * google_project_iam_member.telegram-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_allowed_domains&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_bot_token&#34;]
  * google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_webhook_user_id&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.telegram-sa-roles["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:telegram-sa@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.telegram-sa-roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:telegram-sa@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_allowed_domains"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_bot_token"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_bot_token"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_webhook_user_id"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_webhook_user_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":185,"Program":"tfcmt","SHA1":"61dc50ae82606cce0e94f2965915d802aed250ae","Vars":{},"WorkflowName":"iaac_plan"} -->